let play1 = document.querySelector('.play1'); // Получаем кнопку
play1.addEventListener('click', function (e) {
  e.preventDefault();

  let intro = "Вітаю! це ігра Вгадай число! Програма генерує число від 1 до 10.";
  alert(intro); // Выводим приветственное сообщение
  let start = confirm("Почнемо?");

  if ( start ) {

    const randomNumber = Math.floor(Math.random() * 10) + 1;
    let result = +prompt("Введіть число!");

    if ( result <= 10 ) {
      
      if (randomNumber === result) {
        alert(`Ура! Ви виграли! Це число ${randomNumber} Молодець!!!`);
      } else {
        alert(`Не турбуйтеся! Це число ${randomNumber}.`);
      }
      console.log(typeof result);
    } else {
      alert("Ви ввели не число чи воно більше 10!")
    }

  } else {
    alert("Можливо, в інший раз. До побачення!");
  };

});




let play2 = document.querySelector('.play2'); // Получаем кнопку
play2.addEventListener('click', function(e){
  e.preventDefault();

  alert("У королівстві, де легенди оживають, молодий оруженосець Люк мріє стати рицарем. Він служить Сір Роберту, рицарю, який вважає, що честь — це найвища добродійність.");

  let part = confirm("ЧАСТИНА 1: Початок шляху. Сір Роберт ставить перед Люком випробування, що визначить його долю.");

  if (part) { 

    let choice1 = prompt("Вирушити в ліс: Люк зустрічає чарівницю, що пропонує зілля сили в обмін на обіцянку. «1» - Прийняти зілля: Люк отримує надприродну силу, але залишається в боргу перед чарівницею. «2» - Відмовитися: Люк вибирає чесний шлях, відмовляючись від легкого успіху.");

    if (choice1 != null) {
      let choice2 = prompt("Піти через село: Люк допомагає селянам, які потерпають від голови розбійників. «1» - Допомогти силою: Люк використовує силу для захисту селян, але отримує поранення. «2» - Знайти мирне рішення: Люк вирішує конфлікти миром, заробляючи повагу як лідера.");

      if (choice2 != null) {
        let choice3 = prompt("Відправитися до замку дракона: Люк вирішує випробувати себе, викликаючи дракона на бій. «1» - Бій з драконом: Люк гине, але його вчинок вважається героїчним. «2» - Спроба перемовин: Люк дізнається, що дракон не хоче воювати, і вони досягають миру.");

        if (choice3 != null) {
          alert("ЧАСТИНА 2: Турнір.");

          let tournament = prompt("Після повернення з подорожей Люка викликають на турнір. «1» - Боротьба за честь: Люк демонструє свої навички, здобуваючи повагу. «2» - Допомога іншому учаснику: Люк допомагає пораненому рицарю, показуючи своє серце. «3» - Відмова від бою: Люк відмовляється боротися, стверджуючи, що справжній рицар знає, коли не варто воювати.");

          if (tournament != null) {
            alert("ЧАСТИНА 3: Випробування короля");

            let task = prompt("Король, вражений діями Люка, пропонує йому останнє завдання. «1» - Захистити королівство: Люк веде війська проти ворога, демонструючи свою відвагу. «2» - Пошук зниклої реліквії: Люк вирушає за древньою реліквією, що може врятувати королівство.");

            
            if (task != null) {
              // финал
              if (choice1 === Number(2) && tournament === Number(1)) {
                alert("Люк стає рицарем, відомим своєю чесністю та мужністю, обираючи шлях служіння королівству.");
              } else {
                alert("Люк стає помічником чарівници і допомагає помогати людям.");
              }

              if (choice2 === Number(2) && tournament === Number(3)) {
                alert ("Люк залишає турнір, стаючи захисником селян і прикладом для інших, що справжня сила криється в мудрості та співчутті.");
              } else {
                alert("Люк залишає турнір, стаючи захисником селян і прикладом для інших, що справжня сила криється в мудрості та співчутті.");
              }

              if (choice3 === Number(2) && task === Number(2)) {
                alert("Люк доводить, що можна знайти мир навіть із драконами, і врятувати королівство без насильства, стаючи легендою.");
              }

              if (choice3 === Number(1)) {
                alert("Люк гине, але його ім'я вічно живе в легендах як символ непереможної сміливості та жертовності.");
              }

            } else {
              alert("До зустрічі! Можливо, в інший раз.");
            }

          } else {
            alert("До зустрічі! Можливо, в інший раз.");
          }

        } else {
          alert("До зустрічі! Можливо, в інший раз.");
        }

      } else {
        alert("До зустрічі! Можливо, в інший раз.");
      }

    } else {
      alert("До зустрічі! Можливо, в інший раз.");
    }

  } else {
    alert("До зустрічі! Можливо, в інший раз.");
  }

});

